{
    "languages": [
        {
            "id": 1,
            "text": "English",
            "level": "Pre-Intermediate (A2)"
        }, 
        {
            "id": 2,
            "text": "Russian",
            "level": "Fluency"
        },
        {
            "id": 3,
            "text": "Kazakh",
            "level": "Native"
        }
    ],
    "jobs": [
        {
            "id": 1,
            "position": "Middle Frontend Engineer",
            "start_date": "May 2022",
            "end_date": "present",
            "duration": "8 months",
            "company": "LLP Prime Source",
            "type": "Full-time",
            "description": {
                "text": "Becoming a middle developer worked on a Kino.kz from Halyk bank. Thanks to well-coordinated teamwork, we completed the redesign of the mobile version of the project. Since the project itself was a microservice, I also participated in the development of widgets(kino/partners), email templates, admin parts.",
                "responsibilities": [
                    "Redesign of the mobile version of the project developed from scratch.",
                    "Successfully implemented OTP authorization.",
                    "Improved analytics with Google Tag Manager.",
                    "Redesign of the email template has been improved.",
                    "Refactored the admin part of the project by adding Redux Toolkit."
                ],
                "technologies": [
                    "React",
                    "Typescript",
                    "Eslint",
                    "Next",
                    "i18n",
                    "Redux Toolkit",
                    "Sendsay",
                    "SCSS"              
                ]
            }
        },
        {
            "id": 2,
            "position": "Junior Frontend Engineer",
            "start_date": "Jan 2021",
            "end_date": "Jan 2023",
            "duration": "2 year",
            "company": "Python RPA Ltd.",
            "type": "Full-time",
            "description": {
                "text": "Python RPA is a company that empowers you to automate repetitive tasks with no coding needed. Working in this company, he was engaged in the implementation of business processes for the second-tier bank 'Al-Hilal', such as: establishing a new client (through a contact center, branch), setting thresholds for transfers, issuing a debit card, etc.",
                "responsibilities": [
                    "Сreation of a BPM platform for the implementation of business processes.",
                    "Implementing dynamic forms using the library react-hook-form.",
                    "Using a websocket, check the data for the trustworthiness of the client."
                ],
                "technologies": [
                    "React",
                    "Redux Saga",
                    "Bootstrap",
                    "SCSS"                ]
            }
        },
        {
            "id": 3,
            "position": "Junior Frontend Engineer",
            "start_date": "Oct 2020",
            "end_date": "Sep 2021",
            "duration": "9 months",
            "company": "GoCrowd Limited",
            "type": "Full-time",
            "description": {
                "text": "While developing an MVP for a young startup like GoCrowd, I had a chance to develop using modern technologies as a Next.js, Ruby on Rails. The project developed rapidly as there were daily calls, discussions. Supported the development of the platform together with the middle developer during which I was responsible for:",
                "responsibilities": [
                    "Development of forms for retail investors and business angels.",
                    "Implementation of identity verification through KYC.",
                    "Development of onboarding for start-ups on the example of Wefunder, Kickstarter."
                ],
                "technologies": [
                    "Ruby on Rails",
                    "PostgreSQL",
                    "React",
                    "Next",
                    "SCSS"                ]
            }
        },
        {
            "id": 4,
            "position": "Junior Full Stack Engineer",
            "start_date": "Aug 2020",
            "end_date": "Jan 2021",
            "duration": "5 months",
            "company": "LLP Soft Cloud",
            "type": "Contract",
            "description": {
                "text": "I was involved in the development of a purchasing system for a chain of restaurants Chechil Pub. During the development, several features were made, such as requesting products through the chef, sending notifications via Telegram bot, searching for products, reporting on purchased products, etc. With the help of Wakatime, the time spent on development was actively tracked.",
                "responsibilities": [
                    "Implemented an algorithm for requesting products depending on their needs.",
                    "Invented various options for notifications through Telegram API.",
                    "Created role based api protection (guards)."
                ],
                "technologies": [
                    "Node",
                    "Koa",
                    "Mongoose",
                    "MongoDB",
                    "Telegram API",
                    "React",
                    "Redux",
                    "SCSS",
                    "Material UI"
                ]
            }
        },
        {
            "id": 5,
            "position": "Intern Full Stack Engineer",
            "start_date": "May 2020",
            "end_date": "Aug 2020",
            "duration": "3 months",
            "company": "LLP Decode Group",
            "type": "Internship",
            "description": {
                "text": "Development of an educational online platform, a personal brand marathon of a well-known marketer.",
                "responsibilities": [
                    "Maintained and developed various page of components.",
                    "Developed business logic, UML modeling together with the team.",
                    "Implemented an API for creating courses and lessons, as well as an admin part, CRUD operations."
                ],
                "technologies": [
                    "Node",
                    "Express",
                    "Sequelize",
                    "PostgreSQL",
                    "React",
                    "Redux",
                    "SCSS"
                ]
            }
        }
    ]
}